MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH144/mcu.h
extern volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs"), address(0xBF8103D0)));
extern volatile uint32_t        IPC41CLR __attribute__((section("sfrs"),address(0xBF8103D4)));
extern volatile uint32_t        IPC41SET __attribute__((section("sfrs"),address(0xBF8103D8)));
extern volatile uint32_t        IPC41INV __attribute__((section("sfrs"),address(0xBF8103DC)));
#define IPC42 IPC42
extern volatile uint32_t   IPC42 __attribute__((section("sfrs"), address(0xBF8103E0)));
typedef union {
  struct {
    uint32_t PREIS:2;
    uint32_t PREIP:3;
    uint32_t :3;
    uint32_t SQI1IS:2;
    uint32_t SQI1IP:3;
    uint32_t :3;
    uint32_t U4EIS:2;
    uint32_t U4EIP:3;
    uint32_t :3;
    uint32_t U4RXIS:2;
    uint32_t U4RXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC42bits_t;
extern volatile __IPC42bits_t IPC42bits __asm__ ("IPC42") __attribute__((section("sfrs"), address(0xBF8103E0)));
extern volatile uint32_t        IPC42CLR __attribute__((section("sfrs"),address(0xBF8103E4)));
extern volatile uint32_t        IPC42SET __attribute__((section("sfrs"),address(0xBF8103E8)));
extern volatile uint32_t        IPC42INV __attribute__((section("sfrs"),address(0xBF8103EC)));
#define IPC43 IPC43
extern volatile uint32_t   IPC43 __attribute__((section("sfrs"), address(0xBF8103F0)));
typedef union {
  struct {
    uint32_t U4TXIS:2;
    uint32_t U4TXIP:3;
    uint32_t :3;
    uint32_t I2C4BIS:2;
    uint32_t I2C4BIP:3;
    uint32_t :3;
    uint32_t I2C4SIS:2;
    uint32_t I2C4SIP:3;
    uint32_t :3;
    uint32_t I2C4MIS:2;
    uint32_t I2C4MIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC43bits_t;
extern volatile __IPC43bits_t IPC43bits __asm__ ("IPC43") __attribute__((section("sfrs"), address(0xBF8103F0)));
extern volatile uint32_t        IPC43CLR __attribute__((section("sfrs"),address(0xBF8103F4)));
extern volatile uint32_t        IPC43SET __attribute__((section("sfrs"),address(0xBF8103F8)));
extern volatile uint32_t        IPC43INV __attribute__((section("sfrs"),address(0xBF8103FC)));
#define IPC44 IPC44
extern volatile uint32_t   IPC44 __attribute__((section("sfrs"), address(0xBF810400)));
typedef union {
  struct {
    uint32_t SPI5EIS:2;
    uint32_t SPI5EIP:3;
    uint32_t :3;
    uint32_t SPI5RXIS:2;
    uint32_t SPI5RXIP:3;
    uint32_t :3;
    uint32_t SPI5TXIS:2;
    uint32_t SPI5TXIP:3;
    uint32_t :3;
    uint32_t U5EIS:2;
    uint32_t U5EIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC44bits_t;
extern volatile __IPC44bits_t IPC44bits __asm__ ("IPC44") __attribute__((section("sfrs"), address(0xBF810400)));
extern volatile uint32_t        IPC44CLR __attribute__((section("sfrs"),address(0xBF810404)));
extern volatile uint32_t        IPC44SET __attribute__((section("sfrs"),address(0xBF810408)));
extern volatile uint32_t        IPC44INV __attribute__((section("sfrs"),address(0xBF81040C)));
#define IPC45 IPC45
extern volatile uint32_t   IPC45 __attribute__((section("sfrs"), address(0xBF810410)));
typedef union {
  struct {
    uint32_t U5RXIS:2;
    uint32_t U5RXIP:3;
    uint32_t :3;
    uint32_t U5TXIS:2;
    uint32_t U5TXIP:3;
    uint32_t :3;
    uint32_t I2C5BIS:2;
    uint32_t I2C5BIP:3;
    uint32_t :3;
    uint32_t I2C5SIS:2;
    uint32_t I2C5SIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC45bits_t;
extern volatile __IPC45bits_t IPC45bits __asm__ ("IPC45") __attribute__((section("sfrs"), address(0xBF810410)));
extern volatile uint32_t        IPC45CLR __attribute__((section("sfrs"),address(0xBF810414)));
extern volatile uint32_t        IPC45SET __attribute__((section("sfrs"),address(0xBF810418)));
extern volatile uint32_t        IPC45INV __attribute__((section("sfrs"),address(0xBF81041C)));
#define IPC46 IPC46
extern volatile uint32_t   IPC46 __attribute__((section("sfrs"), address(0xBF810420)));
typedef union {
  struct {
    uint32_t I2C5MIS:2;
    uint32_t I2C5MIP:3;
    uint32_t :3;
    uint32_t SPI6EIS:2;
    uint32_t SPI6EIP:3;
    uint32_t :3;
    uint32_t SPI6RXIS:2;
    uint32_t SPI6RXIP:3;
    uint32_t :3;
    uint32_t SPI6TXIS:2;
    uint32_t SPI6TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC46bits_t;
extern volatile __IPC46bits_t IPC46bits __asm__ ("IPC46") __attribute__((section("sfrs"), address(0xBF810420)));
extern volatile uint32_t        IPC46CLR __attribute__((section("sfrs"),address(0xBF810424)));
extern volatile uint32_t        IPC46SET __attribute__((section("sfrs"),address(0xBF810428)));
extern volatile uint32_t        IPC46INV __attribute__((section("sfrs"),address(0xBF81042C)));
#define IPC47 IPC47
extern volatile uint32_t   IPC47 __attribute__((section("sfrs"), address(0xBF810430)));
typedef union {
  struct {
    uint32_t U6EIS:2;
    uint32_t U6EIP:3;
    uint32_t :3;
    uint32_t U6RXIS:2;
    uint32_t U6RXIP:3;
    uint32_t :3;
    uint32_t U6TXIS:2;
    uint32_t U6TXIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC47bits_t;
extern volatile __IPC47bits_t IPC47bits __asm__ ("IPC47") __attribute__((section("sfrs"), address(0xBF810430)));
extern volatile uint32_t        IPC47CLR __attribute__((section("sfrs"),address(0xBF810434)));
extern volatile uint32_t        IPC47SET __attribute__((section("sfrs"),address(0xBF810438)));
extern volatile uint32_t        IPC47INV __attribute__((section("sfrs"),address(0xBF81043C)));
#define OFF000 OFF000
extern volatile uint32_t   OFF000 __attribute__((section("sfrs"), address(0xBF810540)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF000bits_t;
extern volatile __OFF000bits_t OFF000bits __asm__ ("OFF000") __attribute__((section("sfrs"), address(0xBF810540)));
#define OFF001 OFF001
extern volatile uint32_t   OFF001 __attribute__((section("sfrs"), address(0xBF810544)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF001bits_t;
extern volatile __OFF001bits_t OFF001bits __asm__ ("OFF001") __attribute__((section("sfrs"), address(0xBF810544)));
#define OFF002 OFF002
extern volatile uint32_t   OFF002 __attribute__((section("sfrs"), address(0xBF810548)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF002bits_t;
extern volatile __OFF002bits_t OFF002bits __asm__ ("OFF002") __attribute__((section("sfrs"), address(0xBF810548)));
#define OFF003 OFF003
extern volatile uint32_t   OFF003 __attribute__((section("sfrs"), address(0xBF81054C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF003bits_t;
extern volatile __OFF003bits_t OFF003bits __asm__ ("OFF003") __attribute__((section("sfrs"), address(0xBF81054C)));
#define OFF004 OFF004
extern volatile uint32_t   OFF004 __attribute__((section("sfrs"), address(0xBF810550)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF004bits_t;
extern volatile __OFF004bits_t OFF004bits __asm__ ("OFF004") __attribute__((section("sfrs"), address(0xBF810550)));
#define OFF005 OFF005
extern volatile uint32_t   OFF005 __attribute__((section("sfrs"), address(0xBF810554)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF005bits_t;
extern volatile __OFF005bits_t OFF005bits __asm__ ("OFF005") __attribute__((section("sfrs"), address(0xBF810554)));
#define OFF006 OFF006
extern volatile uint32_t   OFF006 __attribute__((section("sfrs"), address(0xBF810558)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF006bits_t;
extern volatile __OFF006bits_t OFF006bits __asm__ ("OFF006") __attribute__((section("sfrs"), address(0xBF810558)));
#define OFF007 OFF007
extern volatile uint32_t   OFF007 __attribute__((section("sfrs"), address(0xBF81055C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF007bits_t;
extern volatile __OFF007bits_t OFF007bits __asm__ ("OFF007") __attribute__((section("sfrs"), address(0xBF81055C)));
#define OFF008 OFF008
extern volatile uint32_t   OFF008 __attribute__((section("sfrs"), address(0xBF810560)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF008bits_t;
extern volatile __OFF008bits_t OFF008bits __asm__ ("OFF008") __attribute__((section("sfrs"), address(0xBF810560)));
#define OFF009 OFF009
extern volatile uint32_t   OFF009 __attribute__((section("sfrs"), address(0xBF810564)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF009bits_t;
