MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH144/mcu.h
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF860680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF860684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF860688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF86068C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF860690)));
typedef union {
  struct {
    uint32_t CNSTATG0:1;
    uint32_t CNSTATG1:1;
    uint32_t :4;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
    uint32_t :2;
    uint32_t CNSTATG12:1;
    uint32_t CNSTATG13:1;
    uint32_t CNSTATG14:1;
    uint32_t CNSTATG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF860690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF860694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF860698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF86069C)));
#define ANSELH ANSELH
extern volatile uint32_t   ANSELH __attribute__((section("sfrs"), address(0xBF860700)));
typedef union {
  struct {
    uint32_t ANSH0:1;
    uint32_t ANSH1:1;
    uint32_t :2;
    uint32_t ANSH4:1;
    uint32_t ANSH5:1;
    uint32_t ANSH6:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELHbits_t;
extern volatile __ANSELHbits_t ANSELHbits __asm__ ("ANSELH") __attribute__((section("sfrs"), address(0xBF860700)));
extern volatile uint32_t        ANSELHCLR __attribute__((section("sfrs"),address(0xBF860704)));
extern volatile uint32_t        ANSELHSET __attribute__((section("sfrs"),address(0xBF860708)));
extern volatile uint32_t        ANSELHINV __attribute__((section("sfrs"),address(0xBF86070C)));
#define TRISH TRISH
extern volatile uint32_t   TRISH __attribute__((section("sfrs"), address(0xBF860710)));
typedef union {
  struct {
    uint32_t TRISH0:1;
    uint32_t TRISH1:1;
    uint32_t TRISH2:1;
    uint32_t TRISH3:1;
    uint32_t TRISH4:1;
    uint32_t TRISH5:1;
    uint32_t TRISH6:1;
    uint32_t TRISH7:1;
    uint32_t TRISH8:1;
    uint32_t TRISH9:1;
    uint32_t TRISH10:1;
    uint32_t TRISH11:1;
    uint32_t TRISH12:1;
    uint32_t TRISH13:1;
    uint32_t TRISH14:1;
    uint32_t TRISH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISHbits_t;
extern volatile __TRISHbits_t TRISHbits __asm__ ("TRISH") __attribute__((section("sfrs"), address(0xBF860710)));
extern volatile uint32_t        TRISHCLR __attribute__((section("sfrs"),address(0xBF860714)));
extern volatile uint32_t        TRISHSET __attribute__((section("sfrs"),address(0xBF860718)));
extern volatile uint32_t        TRISHINV __attribute__((section("sfrs"),address(0xBF86071C)));
#define PORTH PORTH
extern volatile uint32_t   PORTH __attribute__((section("sfrs"), address(0xBF860720)));
typedef union {
  struct {
    uint32_t RH0:1;
    uint32_t RH1:1;
    uint32_t RH2:1;
    uint32_t RH3:1;
    uint32_t RH4:1;
    uint32_t RH5:1;
    uint32_t RH6:1;
    uint32_t RH7:1;
    uint32_t RH8:1;
    uint32_t RH9:1;
    uint32_t RH10:1;
    uint32_t RH11:1;
    uint32_t RH12:1;
    uint32_t RH13:1;
    uint32_t RH14:1;
    uint32_t RH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTHbits_t;
extern volatile __PORTHbits_t PORTHbits __asm__ ("PORTH") __attribute__((section("sfrs"), address(0xBF860720)));
extern volatile uint32_t        PORTHCLR __attribute__((section("sfrs"),address(0xBF860724)));
extern volatile uint32_t        PORTHSET __attribute__((section("sfrs"),address(0xBF860728)));
extern volatile uint32_t        PORTHINV __attribute__((section("sfrs"),address(0xBF86072C)));
#define LATH LATH
extern volatile uint32_t   LATH __attribute__((section("sfrs"), address(0xBF860730)));
typedef union {
  struct {
    uint32_t LATH0:1;
    uint32_t LATH1:1;
    uint32_t LATH2:1;
    uint32_t LATH3:1;
    uint32_t LATH4:1;
    uint32_t LATH5:1;
    uint32_t LATH6:1;
    uint32_t LATH7:1;
    uint32_t LATH8:1;
    uint32_t LATH9:1;
    uint32_t LATH10:1;
    uint32_t LATH11:1;
    uint32_t LATH12:1;
    uint32_t LATH13:1;
    uint32_t LATH14:1;
    uint32_t LATH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATHbits_t;
extern volatile __LATHbits_t LATHbits __asm__ ("LATH") __attribute__((section("sfrs"), address(0xBF860730)));
extern volatile uint32_t        LATHCLR __attribute__((section("sfrs"),address(0xBF860734)));
extern volatile uint32_t        LATHSET __attribute__((section("sfrs"),address(0xBF860738)));
extern volatile uint32_t        LATHINV __attribute__((section("sfrs"),address(0xBF86073C)));
#define ODCH ODCH
extern volatile uint32_t   ODCH __attribute__((section("sfrs"), address(0xBF860740)));
typedef union {
  struct {
    uint32_t ODCH0:1;
    uint32_t ODCH1:1;
    uint32_t ODCH2:1;
    uint32_t ODCH3:1;
    uint32_t ODCH4:1;
    uint32_t ODCH5:1;
    uint32_t ODCH6:1;
    uint32_t ODCH7:1;
    uint32_t ODCH8:1;
    uint32_t ODCH9:1;
    uint32_t ODCH10:1;
    uint32_t ODCH11:1;
    uint32_t ODCH12:1;
    uint32_t ODCH13:1;
    uint32_t ODCH14:1;
    uint32_t ODCH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCHbits_t;
extern volatile __ODCHbits_t ODCHbits __asm__ ("ODCH") __attribute__((section("sfrs"), address(0xBF860740)));
extern volatile uint32_t        ODCHCLR __attribute__((section("sfrs"),address(0xBF860744)));
extern volatile uint32_t        ODCHSET __attribute__((section("sfrs"),address(0xBF860748)));
extern volatile uint32_t        ODCHINV __attribute__((section("sfrs"),address(0xBF86074C)));
#define CNPUH CNPUH
extern volatile uint32_t   CNPUH __attribute__((section("sfrs"), address(0xBF860750)));
typedef union {
  struct {
    uint32_t CNPUH0:1;
    uint32_t CNPUH1:1;
    uint32_t CNPUH2:1;
    uint32_t CNPUH3:1;
    uint32_t CNPUH4:1;
    uint32_t CNPUH5:1;
    uint32_t CNPUH6:1;
    uint32_t CNPUH7:1;
    uint32_t CNPUH8:1;
    uint32_t CNPUH9:1;
    uint32_t CNPUH10:1;
    uint32_t CNPUH11:1;
    uint32_t CNPUH12:1;
    uint32_t CNPUH13:1;
    uint32_t CNPUH14:1;
    uint32_t CNPUH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUHbits_t;
extern volatile __CNPUHbits_t CNPUHbits __asm__ ("CNPUH") __attribute__((section("sfrs"), address(0xBF860750)));
extern volatile uint32_t        CNPUHCLR __attribute__((section("sfrs"),address(0xBF860754)));
extern volatile uint32_t        CNPUHSET __attribute__((section("sfrs"),address(0xBF860758)));
extern volatile uint32_t        CNPUHINV __attribute__((section("sfrs"),address(0xBF86075C)));
#define CNPDH CNPDH
extern volatile uint32_t   CNPDH __attribute__((section("sfrs"), address(0xBF860760)));
typedef union {
  struct {
    uint32_t CNPDH0:1;
    uint32_t CNPDH1:1;
    uint32_t CNPDH2:1;
    uint32_t CNPDH3:1;
    uint32_t CNPDH4:1;
    uint32_t CNPDH5:1;
    uint32_t CNPDH6:1;
    uint32_t CNPDH7:1;
    uint32_t CNPDH8:1;
    uint32_t CNPDH9:1;
    uint32_t CNPDH10:1;
    uint32_t CNPDH11:1;
    uint32_t CNPDH12:1;
    uint32_t CNPDH13:1;
    uint32_t CNPDH14:1;
    uint32_t CNPDH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDHbits_t;
extern volatile __CNPDHbits_t CNPDHbits __asm__ ("CNPDH") __attribute__((section("sfrs"), address(0xBF860760)));
extern volatile uint32_t        CNPDHCLR __attribute__((section("sfrs"),address(0xBF860764)));
extern volatile uint32_t        CNPDHSET __attribute__((section("sfrs"),address(0xBF860768)));
extern volatile uint32_t        CNPDHINV __attribute__((section("sfrs"),address(0xBF86076C)));
#define CNCONH CNCONH
extern volatile uint32_t   CNCONH __attribute__((section("sfrs"), address(0xBF860770)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONHbits_t;
extern volatile __CNCONHbits_t CNCONHbits __asm__ ("CNCONH") __attribute__((section("sfrs"), address(0xBF860770)));
extern volatile uint32_t        CNCONHCLR __attribute__((section("sfrs"),address(0xBF860774)));
extern volatile uint32_t        CNCONHSET __attribute__((section("sfrs"),address(0xBF860778)));
extern volatile uint32_t        CNCONHINV __attribute__((section("sfrs"),address(0xBF86077C)));
#define CNENH CNENH
extern volatile uint32_t   CNENH __attribute__((section("sfrs"), address(0xBF860780)));
typedef union {
  struct {
    uint32_t CNIEH0:1;
    uint32_t CNIEH1:1;
    uint32_t CNIEH2:1;
    uint32_t CNIEH3:1;
    uint32_t CNIEH4:1;
    uint32_t CNIEH5:1;
    uint32_t CNIEH6:1;
    uint32_t CNIEH7:1;
    uint32_t CNIEH8:1;
    uint32_t CNIEH9:1;
    uint32_t CNIEH10:1;
    uint32_t CNIEH11:1;
    uint32_t CNIEH12:1;
    uint32_t CNIEH13:1;
    uint32_t CNIEH14:1;
    uint32_t CNIEH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENHbits_t;
extern volatile __CNENHbits_t CNENHbits __asm__ ("CNENH") __attribute__((section("sfrs"), address(0xBF860780)));
extern volatile uint32_t        CNENHCLR __attribute__((section("sfrs"),address(0xBF860784)));
extern volatile uint32_t        CNENHSET __attribute__((section("sfrs"),address(0xBF860788)));
extern volatile uint32_t        CNENHINV __attribute__((section("sfrs"),address(0xBF86078C)));
#define CNSTATH CNSTATH
extern volatile uint32_t   CNSTATH __attribute__((section("sfrs"), address(0xBF860790)));
typedef union {
  struct {
    uint32_t CNSTATH0:1;
    uint32_t CNSTATH1:1;
    uint32_t CNSTATH2:1;
    uint32_t CNSTATH3:1;
    uint32_t CNSTATH4:1;
    uint32_t CNSTATH5:1;
    uint32_t CNSTATH6:1;
    uint32_t CNSTATH7:1;
    uint32_t CNSTATH8:1;
    uint32_t CNSTATH9:1;
    uint32_t CNSTATH10:1;
    uint32_t CNSTATH11:1;
    uint32_t CNSTATH12:1;
    uint32_t CNSTATH13:1;
    uint32_t CNSTATH14:1;
    uint32_t CNSTATH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATHbits_t;
extern volatile __CNSTATHbits_t CNSTATHbits __asm__ ("CNSTATH") __attribute__((section("sfrs"), address(0xBF860790)));
extern volatile uint32_t        CNSTATHCLR __attribute__((section("sfrs"),address(0xBF860794)));
extern volatile uint32_t        CNSTATHSET __attribute__((section("sfrs"),address(0xBF860798)));
extern volatile uint32_t        CNSTATHINV __attribute__((section("sfrs"),address(0xBF86079C)));
#define ANSELJ ANSELJ
extern volatile uint32_t   ANSELJ __attribute__((section("sfrs"), address(0xBF860800)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t ANSJ8:1;
    uint32_t ANSJ9:1;
    uint32_t :1;
    uint32_t ANSJ11:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELJbits_t;
extern volatile __ANSELJbits_t ANSELJbits __asm__ ("ANSELJ") __attribute__((section("sfrs"), address(0xBF860800)));
extern volatile uint32_t        ANSELJCLR __attribute__((section("sfrs"),address(0xBF860804)));
extern volatile uint32_t        ANSELJSET __attribute__((section("sfrs"),address(0xBF860808)));
extern volatile uint32_t        ANSELJINV __attribute__((section("sfrs"),address(0xBF86080C)));
#define TRISJ TRISJ
extern volatile uint32_t   TRISJ __attribute__((section("sfrs"), address(0xBF860810)));
typedef union {
  struct {
    uint32_t TRISJ0:1;
    uint32_t TRISJ1:1;
    uint32_t TRISJ2:1;
    uint32_t TRISJ3:1;
    uint32_t TRISJ4:1;
    uint32_t TRISJ5:1;
    uint32_t TRISJ6:1;
    uint32_t TRISJ7:1;
    uint32_t TRISJ8:1;
    uint32_t TRISJ9:1;
    uint32_t TRISJ10:1;
    uint32_t TRISJ11:1;
    uint32_t TRISJ12:1;
    uint32_t TRISJ13:1;
    uint32_t TRISJ14:1;
    uint32_t TRISJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISJbits_t;
extern volatile __TRISJbits_t TRISJbits __asm__ ("TRISJ") __attribute__((section("sfrs"), address(0xBF860810)));
extern volatile uint32_t        TRISJCLR __attribute__((section("sfrs"),address(0xBF860814)));
extern volatile uint32_t        TRISJSET __attribute__((section("sfrs"),address(0xBF860818)));
extern volatile uint32_t        TRISJINV __attribute__((section("sfrs"),address(0xBF86081C)));
#define PORTJ PORTJ
extern volatile uint32_t   PORTJ __attribute__((section("sfrs"), address(0xBF860820)));
typedef union {
  struct {
    uint32_t RJ0:1;
    uint32_t RJ1:1;
    uint32_t RJ2:1;
    uint32_t RJ3:1;
    uint32_t RJ4:1;
    uint32_t RJ5:1;
    uint32_t RJ6:1;
    uint32_t RJ7:1;
    uint32_t RJ8:1;
    uint32_t RJ9:1;
    uint32_t RJ10:1;
    uint32_t RJ11:1;
    uint32_t RJ12:1;
    uint32_t RJ13:1;
    uint32_t RJ14:1;
    uint32_t RJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTJbits_t;
extern volatile __PORTJbits_t PORTJbits __asm__ ("PORTJ") __attribute__((section("sfrs"), address(0xBF860820)));
extern volatile uint32_t        PORTJCLR __attribute__((section("sfrs"),address(0xBF860824)));
extern volatile uint32_t        PORTJSET __attribute__((section("sfrs"),address(0xBF860828)));
extern volatile uint32_t        PORTJINV __attribute__((section("sfrs"),address(0xBF86082C)));
#define LATJ LATJ
extern volatile uint32_t   LATJ __attribute__((section("sfrs"), address(0xBF860830)));
typedef union {
  struct {
    uint32_t LATJ0:1;
    uint32_t LATJ1:1;
    uint32_t LATJ2:1;
    uint32_t LATJ3:1;
    uint32_t LATJ4:1;
    uint32_t LATJ5:1;
    uint32_t LATJ6:1;
    uint32_t LATJ7:1;
    uint32_t LATJ8:1;
    uint32_t LATJ9:1;
    uint32_t LATJ10:1;
    uint32_t LATJ11:1;
    uint32_t LATJ12:1;
    uint32_t LATJ13:1;
    uint32_t LATJ14:1;
    uint32_t LATJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATJbits_t;
extern volatile __LATJbits_t LATJbits __asm__ ("LATJ") __attribute__((section("sfrs"), address(0xBF860830)));
extern volatile uint32_t        LATJCLR __attribute__((section("sfrs"),address(0xBF860834)));
extern volatile uint32_t        LATJSET __attribute__((section("sfrs"),address(0xBF860838)));
extern volatile uint32_t        LATJINV __attribute__((section("sfrs"),address(0xBF86083C)));
#define ODCJ ODCJ
extern volatile uint32_t   ODCJ __attribute__((section("sfrs"), address(0xBF860840)));
typedef union {
  struct {
    uint32_t ODCJ0:1;
    uint32_t ODCJ1:1;
    uint32_t ODCJ2:1;
    uint32_t ODCJ3:1;
    uint32_t ODCJ4:1;
    uint32_t ODCJ5:1;
    uint32_t ODCJ6:1;
    uint32_t ODCJ7:1;
    uint32_t ODCJ8:1;
    uint32_t ODCJ9:1;
    uint32_t ODCJ10:1;
    uint32_t ODCJ11:1;
    uint32_t ODCJ12:1;
    uint32_t ODCJ13:1;
    uint32_t ODCJ14:1;
    uint32_t ODCJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCJbits_t;
extern volatile __ODCJbits_t ODCJbits __asm__ ("ODCJ") __attribute__((section("sfrs"), address(0xBF860840)));
extern volatile uint32_t        ODCJCLR __attribute__((section("sfrs"),address(0xBF860844)));
extern volatile uint32_t        ODCJSET __attribute__((section("sfrs"),address(0xBF860848)));
extern volatile uint32_t        ODCJINV __attribute__((section("sfrs"),address(0xBF86084C)));
#define CNPUJ CNPUJ
extern volatile uint32_t   CNPUJ __attribute__((section("sfrs"), address(0xBF860850)));
typedef union {
  struct {
    uint32_t CNPUJ0:1;
    uint32_t CNPUJ1:1;
    uint32_t CNPUJ2:1;
    uint32_t CNPUJ3:1;
    uint32_t CNPUJ4:1;
    uint32_t CNPUJ5:1;
    uint32_t CNPUJ6:1;
    uint32_t CNPUJ7:1;
    uint32_t CNPUJ8:1;
    uint32_t CNPUJ9:1;
    uint32_t CNPUJ10:1;
    uint32_t CNPUJ11:1;
    uint32_t CNPUJ12:1;
    uint32_t CNPUJ13:1;
    uint32_t CNPUJ14:1;
    uint32_t CNPUJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUJbits_t;
extern volatile __CNPUJbits_t CNPUJbits __asm__ ("CNPUJ") __attribute__((section("sfrs"), address(0xBF860850)));
extern volatile uint32_t        CNPUJCLR __attribute__((section("sfrs"),address(0xBF860854)));
extern volatile uint32_t        CNPUJSET __attribute__((section("sfrs"),address(0xBF860858)));
extern volatile uint32_t        CNPUJINV __attribute__((section("sfrs"),address(0xBF86085C)));
#define CNPDJ CNPDJ
extern volatile uint32_t   CNPDJ __attribute__((section("sfrs"), address(0xBF860860)));
typedef union {
  struct {
    uint32_t CNPDJ0:1;
    uint32_t CNPDJ1:1;
    uint32_t CNPDJ2:1;
    uint32_t CNPDJ3:1;
    uint32_t CNPDJ4:1;
    uint32_t CNPDJ5:1;
    uint32_t CNPDJ6:1;
    uint32_t CNPDJ7:1;
    uint32_t CNPDJ8:1;
    uint32_t CNPDJ9:1;
    uint32_t CNPDJ10:1;
    uint32_t CNPDJ11:1;
    uint32_t CNPDJ12:1;
    uint32_t CNPDJ13:1;
    uint32_t CNPDJ14:1;
    uint32_t CNPDJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDJbits_t;
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs"), address(0xBF860860)));
extern volatile uint32_t        CNPDJCLR __attribute__((section("sfrs"),address(0xBF860864)));
extern volatile uint32_t        CNPDJSET __attribute__((section("sfrs"),address(0xBF860868)));
extern volatile uint32_t        CNPDJINV __attribute__((section("sfrs"),address(0xBF86086C)));
#define CNCONJ CNCONJ
extern volatile uint32_t   CNCONJ __attribute__((section("sfrs"), address(0xBF860870)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs"), address(0xBF860870)));
extern volatile uint32_t        CNCONJCLR __attribute__((section("sfrs"),address(0xBF860874)));
extern volatile uint32_t        CNCONJSET __attribute__((section("sfrs"),address(0xBF860878)));
extern volatile uint32_t        CNCONJINV __attribute__((section("sfrs"),address(0xBF86087C)));
#define CNENJ CNENJ
extern volatile uint32_t   CNENJ __attribute__((section("sfrs"), address(0xBF860880)));
typedef union {
  struct {
    uint32_t CNIEJ0:1;
    uint32_t CNIEJ1:1;
    uint32_t CNIEJ2:1;
    uint32_t CNIEJ3:1;
    uint32_t CNIEJ4:1;
    uint32_t CNIEJ5:1;
    uint32_t CNIEJ6:1;
    uint32_t CNIEJ7:1;
    uint32_t CNIEJ8:1;
    uint32_t CNIEJ9:1;
    uint32_t CNIEJ10:1;
    uint32_t CNIEJ11:1;
    uint32_t CNIEJ12:1;
    uint32_t CNIEJ13:1;
    uint32_t CNIEJ14:1;
    uint32_t CNIEJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs"), address(0xBF860880)));
extern volatile uint32_t        CNENJCLR __attribute__((section("sfrs"),address(0xBF860884)));
extern volatile uint32_t        CNENJSET __attribute__((section("sfrs"),address(0xBF860888)));
extern volatile uint32_t        CNENJINV __attribute__((section("sfrs"),address(0xBF86088C)));
#define CNSTATJ CNSTATJ
extern volatile uint32_t   CNSTATJ __attribute__((section("sfrs"), address(0xBF860890)));
typedef union {
  struct {
    uint32_t CNSTATJ0:1;
    uint32_t CNSTATJ1:1;
    uint32_t CNSTATJ2:1;
    uint32_t CNSTATJ3:1;
    uint32_t CNSTATJ4:1;
    uint32_t CNSTATJ5:1;
    uint32_t CNSTATJ6:1;
    uint32_t CNSTATJ7:1;
    uint32_t CNSTATJ8:1;
    uint32_t CNSTATJ9:1;
    uint32_t CNSTATJ10:1;
    uint32_t CNSTATJ11:1;
    uint32_t CNSTATJ12:1;
    uint32_t CNSTATJ13:1;
    uint32_t CNSTATJ14:1;
    uint32_t CNSTATJ15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs"), address(0xBF860890)));
extern volatile uint32_t        CNSTATJCLR __attribute__((section("sfrs"),address(0xBF860894)));
extern volatile uint32_t        CNSTATJSET __attribute__((section("sfrs"),address(0xBF860898)));
extern volatile uint32_t        CNSTATJINV __attribute__((section("sfrs"),address(0xBF86089C)));
#define ANSELK ANSELK
extern volatile uint32_t   ANSELK __attribute__((section("sfrs"), address(0xBF860900)));
typedef struct {
  uint32_t w:32;
} __ANSELKbits_t;
extern volatile __ANSELKbits_t ANSELKbits __asm__ ("ANSELK") __attribute__((section("sfrs"), address(0xBF860900)));
extern volatile uint32_t        ANSELKCLR __attribute__((section("sfrs"),address(0xBF860904)));
extern volatile uint32_t        ANSELKSET __attribute__((section("sfrs"),address(0xBF860908)));
extern volatile uint32_t        ANSELKINV __attribute__((section("sfrs"),address(0xBF86090C)));
#define TRISK TRISK
extern volatile uint32_t   TRISK __attribute__((section("sfrs"), address(0xBF860910)));
typedef union {
  struct {
    uint32_t TRISK0:1;
    uint32_t TRISK1:1;
    uint32_t TRISK2:1;
    uint32_t TRISK3:1;
    uint32_t TRISK4:1;
    uint32_t TRISK5:1;
    uint32_t TRISK6:1;
    uint32_t TRISK7:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISKbits_t;
