MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH144/mcu.h
#define _USBIE0CSR3_MPTXEN_POSITION              0x0000001E
#define _USBIE0CSR3_MPTXEN_MASK                  0x40000000
#define _USBIE0CSR3_MPTXEN_LENGTH                0x00000001

#define _USBIE0CSR3_MPRXEN_POSITION              0x0000001F
#define _USBIE0CSR3_MPRXEN_MASK                  0x80000000
#define _USBIE0CSR3_MPRXEN_LENGTH                0x00000001

#define _USBIENCSR3_TEP_POSITION                 0x00000000
#define _USBIENCSR3_TEP_MASK                     0x0000000F
#define _USBIENCSR3_TEP_LENGTH                   0x00000004

#define _USBIENCSR3_PROTOCOL_POSITION            0x00000004
#define _USBIENCSR3_PROTOCOL_MASK                0x00000030
#define _USBIENCSR3_PROTOCOL_LENGTH              0x00000002

#define _USBIENCSR3_SPEED_POSITION               0x00000006
#define _USBIENCSR3_SPEED_MASK                   0x000000C0
#define _USBIENCSR3_SPEED_LENGTH                 0x00000002

#define _USBIENCSR3_RXINTERV_POSITION            0x00000008
#define _USBIENCSR3_RXINTERV_MASK                0x0000FF00
#define _USBIENCSR3_RXINTERV_LENGTH              0x00000008

#define _USBIENCSR3_TXFIFOSZ_POSITION            0x00000018
#define _USBIENCSR3_TXFIFOSZ_MASK                0x0F000000
#define _USBIENCSR3_TXFIFOSZ_LENGTH              0x00000004

#define _USBIENCSR3_RXFIFOSZ_POSITION            0x0000001C
#define _USBIENCSR3_RXFIFOSZ_MASK                0xF0000000
#define _USBIENCSR3_RXFIFOSZ_LENGTH              0x00000004

#define _DEVCFG3_USERID_POSITION                 0x00000000
#define _DEVCFG3_USERID_MASK                     0x0000FFFF
#define _DEVCFG3_USERID_LENGTH                   0x00000010

#define _DEVCFG3_FMIIEN_POSITION                 0x00000018
#define _DEVCFG3_FMIIEN_MASK                     0x01000000
#define _DEVCFG3_FMIIEN_LENGTH                   0x00000001

#define _DEVCFG3_FETHIO_POSITION                 0x00000019
#define _DEVCFG3_FETHIO_MASK                     0x02000000
#define _DEVCFG3_FETHIO_LENGTH                   0x00000001

#define _DEVCFG3_PGL1WAY_POSITION                0x0000001B
#define _DEVCFG3_PGL1WAY_MASK                    0x08000000
#define _DEVCFG3_PGL1WAY_LENGTH                  0x00000001

#define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C
#define _DEVCFG3_PMDL1WAY_MASK                   0x10000000
#define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001

#define _DEVCFG3_IOL1WAY_POSITION                0x0000001D
#define _DEVCFG3_IOL1WAY_MASK                    0x20000000
#define _DEVCFG3_IOL1WAY_LENGTH                  0x00000001

#define _DEVCFG3_FUSBIDIO_POSITION               0x0000001E
#define _DEVCFG3_FUSBIDIO_MASK                   0x40000000
#define _DEVCFG3_FUSBIDIO_LENGTH                 0x00000001

#define _DEVCFG3_w_POSITION                      0x00000000
#define _DEVCFG3_w_MASK                          0xFFFFFFFF
#define _DEVCFG3_w_LENGTH                        0x00000020

#define _DEVCFG2_FPLLIDIV_POSITION               0x00000000
#define _DEVCFG2_FPLLIDIV_MASK                   0x00000007
#define _DEVCFG2_FPLLIDIV_LENGTH                 0x00000003

#define _DEVCFG2_FPLLRNG_POSITION                0x00000004
#define _DEVCFG2_FPLLRNG_MASK                    0x00000070
#define _DEVCFG2_FPLLRNG_LENGTH                  0x00000003

#define _DEVCFG2_FPLLICLK_POSITION               0x00000007
#define _DEVCFG2_FPLLICLK_MASK                   0x00000080
#define _DEVCFG2_FPLLICLK_LENGTH                 0x00000001

#define _DEVCFG2_FPLLMULT_POSITION               0x00000008
#define _DEVCFG2_FPLLMULT_MASK                   0x00007F00
#define _DEVCFG2_FPLLMULT_LENGTH                 0x00000007

#define _DEVCFG2_FPLLODIV_POSITION               0x00000010
#define _DEVCFG2_FPLLODIV_MASK                   0x00070000
#define _DEVCFG2_FPLLODIV_LENGTH                 0x00000003

#define _DEVCFG2_UPLLFSEL_POSITION               0x0000001E
#define _DEVCFG2_UPLLFSEL_MASK                   0x40000000
#define _DEVCFG2_UPLLFSEL_LENGTH                 0x00000001

#define _DEVCFG2_UPLLEN_POSITION                 0x0000001F
#define _DEVCFG2_UPLLEN_MASK                     0x80000000
#define _DEVCFG2_UPLLEN_LENGTH                   0x00000001

#define _DEVCFG2_w_POSITION                      0x00000000
#define _DEVCFG2_w_MASK                          0xFFFFFFFF
#define _DEVCFG2_w_LENGTH                        0x00000020

#define _DEVCFG1_FNOSC_POSITION                  0x00000000
#define _DEVCFG1_FNOSC_MASK                      0x00000007
#define _DEVCFG1_FNOSC_LENGTH                    0x00000003

#define _DEVCFG1_DMTINTV_POSITION                0x00000003
#define _DEVCFG1_DMTINTV_MASK                    0x00000038
#define _DEVCFG1_DMTINTV_LENGTH                  0x00000003

#define _DEVCFG1_FSOSCEN_POSITION                0x00000006
#define _DEVCFG1_FSOSCEN_MASK                    0x00000040
#define _DEVCFG1_FSOSCEN_LENGTH                  0x00000001

#define _DEVCFG1_IESO_POSITION                   0x00000007
#define _DEVCFG1_IESO_MASK                       0x00000080
#define _DEVCFG1_IESO_LENGTH                     0x00000001

#define _DEVCFG1_POSCMOD_POSITION                0x00000008
#define _DEVCFG1_POSCMOD_MASK                    0x00000300
#define _DEVCFG1_POSCMOD_LENGTH                  0x00000002

#define _DEVCFG1_OSCIOFNC_POSITION               0x0000000A
#define _DEVCFG1_OSCIOFNC_MASK                   0x00000400
#define _DEVCFG1_OSCIOFNC_LENGTH                 0x00000001

#define _DEVCFG1_FCKSM_POSITION                  0x0000000E
#define _DEVCFG1_FCKSM_MASK                      0x0000C000
#define _DEVCFG1_FCKSM_LENGTH                    0x00000002

#define _DEVCFG1_WDTPS_POSITION                  0x00000010
#define _DEVCFG1_WDTPS_MASK                      0x001F0000
#define _DEVCFG1_WDTPS_LENGTH                    0x00000005

#define _DEVCFG1_WDTSPGM_POSITION                0x00000015
#define _DEVCFG1_WDTSPGM_MASK                    0x00200000
#define _DEVCFG1_WDTSPGM_LENGTH                  0x00000001

#define _DEVCFG1_WINDIS_POSITION                 0x00000016
#define _DEVCFG1_WINDIS_MASK                     0x00400000
#define _DEVCFG1_WINDIS_LENGTH                   0x00000001

#define _DEVCFG1_FWDTEN_POSITION                 0x00000017
#define _DEVCFG1_FWDTEN_MASK                     0x00800000
#define _DEVCFG1_FWDTEN_LENGTH                   0x00000001

